{
    "title": "SCOTTYCHORD",
    "date": "2024",
    "detail": "Battery-powered mini piano. Play a song on a virtual piano and see\nit performed on the Scottychord real-time.",
    "featured": false,
    "awards": [],
    "extended_details": "The goal of our project was to build a physical piano-like instrument that could play a\nsong inputted by a user. In order to play the piano, the user presses keys (on laptop) in\norder to play notes on a virtual piano UI. The Scottychord then plays the song back with\nthe same melody and rhythm that was played. The instrument is built with lyre strings\nhit by small wooden hammers. These hammers are glued to motors which spin and hit the\nstrings to make music. Each motor is connected to a relay, and each relay is connected to\na single 9V battery source. The relay trigger is connected to an Arduino MEGA’s digital\noutput pins. The piano interface is built using pygame and serial. It sends the song to the\nArduino MEGA as a string. MEGA receives the string via USB and runs code that parses\nthe string and plays the song.\nWe ended up changing much of our implementation. Previously, we designed and 3Dprinted a mechanism to pluck the lyre strings, taking inspiration from guitar picking and\na harpsichord (the precursor to the modern piano). However, we found out that the\nmechanism was too heavy and required too much precision for the motors. We pivoted to a\nwooden hammer mechanism to directly hit the strings to produce sound. The relays ended\nup being used to control which keys are played and when. The strings were strung across\nthe top of the instrument similar to a lyre. We used hot glue to hold the wood together\nand a small breadboard to share the battery source.\n",
    "team_profiles": [
        {
            "username": "",
            "name": "Andrew Gao"
        },
        {
            "username": "",
            "name": "Hannah Noh"
        }
    ],
    "parts_and_costs": [],
    "image": "/project-images/00139.png"
}